package cullicurumB;

public class Question2 {

	public static void main(String[] args) {
//		// TODO 自動生成されたメソッド・スタブ
//		
//	Q1	int 型の変数 score に 75 を代入																							
//		//score が 60 以上なら "合格です！" と表示	
		int score = 75;if(score >= 60) {System.out.println("合格です!");}
//																									
//																									
//	Q2	int 型の変数 age に 25 を代入																							
//		//age が 20 以上 30 以下なら "適正年齢です" と表示																							
//		//それ以外の場合は "対象外です" と表示
		int age = 25;if(score >= 20) {System.out.println("適正年齢です");} else if {System.out.println("対象外です")；｝
		
//																									
//																									
//	Q3	int 型の変数 age に 18 を代入																							
//		//age が 20 以上なら "成人です" と表示																							
//		//age が 13 以上 19 以下なら "ティーンエイジャーです" と表示																							
//		//age が 12 以下なら "子供です" と表示																							
//																									
//																									
//	Q4	int 型の変数 x, y, z に 30, 15, 50 を代入																							
//		//一番大きい数値を判定して表示																							
//																									
//																									
//	Q5	int 型の変数 num を用意																							
//		num の値が 0 より大きければ "正の数です" と表示																							
//		num の値が 0 なら "0 です" と表示																							
//		num の値が 0 より小さければ "負の数です" と表示																							
//																									
//																									
//	Q6	int 型の変数 value を用意																							
//		value が 偶数 なら "偶数です" と表示																							
//		value が 奇数 なら "奇数です" と表示																							
//																									
//																									
//	Q7	int 型の変数 score に 0 から 100 の数値を代入																							
//		90 以上なら "優"																							
//		70 以上なら "良"																							
//		50 以上なら "可"																							
//		50 未満なら "不可"　を表示																							
//																									
//																									
//	Q8	入力が null または空文字（""）のときに「入力が無効です」と表示する処理を作成してください																							
//																									
//																									
//	Q9	int 型の変数 day を用意（1～7 の数値を代入）							条件分岐の中でも複数の値ごとに異なる処理を実行する場合 に使えるのが switch文 です																
//		day の値に応じて曜日を表示							if 文を使っても条件分岐はできますが、選択肢が多いとコードが長くなり、可読性が悪くなる ことがあります。																
//		1 → "月曜日"							そこで、「特定の値ごとに異なる処理をする」 場合には switch 文を使うと便利です！																
//		2 → "火曜日"							「特定の値に応じた処理」を効率よく実装できるようにしていきましょう																
//		3 → "水曜日"																							
//		4 → "木曜日"																							
//		5 → "金曜日"																							
//		6 → "土曜日"																							
//		7 → "日曜日"																							
//		それ以外の値なら "無効な入力です" と表示																							
//		※Switch文を使用してください																							
//																									
//																									
//	Q10	int 型の変数 month を用意（1～12 の数値を代入）																							
//		month の値に応じて季節を表示																							
//		12, 1, 2 → "冬"																							
//		3, 4, 5 → "春"																							
//		6, 7, 8 → "夏"																							
//		9, 10, 11 → "秋"																							
//		それ以外の値なら "無効な月です" と表示																							
//		※Switch文を使用してください																							

	}

}
